app/helpers/sessions_helper.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 101], ["LIMIT", 1]]
---
    def current_user
        if (user_id = session[:user_id])
            user = User.find_by(id: user_id)