app/controllers/microposts_controller.rb

    def create
        @micropost = current_user.microposts.build(micropost_params)
        @micropost.image.attach(params[:micropost][:image])
        if @micropost.save
            flash[:success] = "Micropost created!"
            redirect_to root_url
        else
            @feed_items = current_user.feed.paginate(page: params[:page])
---
INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "jikgvjrk"], ["user_id", 101], ["created_at", "2022-11-03 20:56:12.528181"], ["updated_at", "2022-11-03 20:56:12.528181"]]
INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "gjrjk"], ["user_id", 101], ["created_at", "2022-11-04 01:23:49.233221"], ["updated_at", "2022-11-04 01:23:49.233221"]]
SELECT "microposts".* FROM "microposts" WHERE (user_id = 101) ORDER BY "microposts"."created_at" DESC LIMIT $1 OFFSET $2  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = $1  [["user_id", 101]]

    def destroy
        @micropost.destroy
---
DELETE FROM "microposts" WHERE "microposts"."id" = $1  [["id", 2]]

    def correct_user
      @micropost = current_user.microposts.find_by(id: params[:id])
---
SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = $1 AND "microposts"."id" = $2 ORDER BY "microposts"."created_at" DESC LIMIT $3  [["user_id", 101], ["id", 2], ["LIMIT", 1]]