app/controllers/users_controller.rb

  def index
    @users = User.paginate(page: params[:page])
---
SELECT "users".* FROM "users" LIMIT $1 OFFSET $2  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"

  def show
    @user = User.find(params[:id])
    @microposts = @user.microposts.paginate(page: params[:page])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = $1 ORDER BY "microposts"."created_at" DESC LIMIT $2 OFFSET $3  [["user_id", 101], ["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = $1  [["user_id", 101]]

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest", "remember_digest", "admin") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "example@railstutorial.org"], ["updated_at", "2022-10-31 19:19:32.225317"], ["id", 1]]

  def destroy
    User.find(params[:id]).destroy
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def correct_user
      @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]